In [2]:
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [3]:

df=pd.read_csv("https://raw.githubusercontent.com/harissriramoju/DataScience-Samples/master/gapminder.tsv",sep='\t')

In [4]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [5]:
df.info

<bound method DataFrame.info of           country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]>

In [6]:
df['continent'].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

In [7]:

df.loc[[0,1,2]]

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710

In [8]:
df

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [9]:
df.columns

Index(['country', 'continent', 'year', 'lifeExp', 'pop', 'gdpPercap'], dtype='object')

In [10]:
df.country

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [11]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [12]:
df.iloc[4,2]

1972

In [13]:
df.country

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [14]:
df.year

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

In [15]:
df.continent

0         Asia
1         Asia
2         Asia
3         Asia
4         Asia
         ...
1699    Africa
1700    Africa
1701    Africa
1702    Africa
1703    Africa
Name: continent, Length: 1704, dtype: object

In [16]:
df.pop

<bound method DataFrame.pop of           country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]>

In [17]:
df.sample(5,random_state=10)

                  country continent  year  lifeExp       pop     gdpPercap
1040           Mozambique    Africa  1992   44.284  13160731    410.896824
1308         Saudi Arabia      Asia  1952   39.875   4005677   6459.554823
1041           Mozambique    Africa  1997   46.344  16603334    472.346077
361         Cote d'Ivoire    Africa  1957   42.469   3300000   1500.895925
1558  Trinidad and Tobago  Americas  2002   68.976   1101832  11460.600230

In [18]:
df.sample(8,random_state=10)

                  country continent  year  lifeExp       pop     gdpPercap
1040           Mozambique    Africa  1992   44.284  13160731    410.896824
1308         Saudi Arabia      Asia  1952   39.875   4005677   6459.554823
1041           Mozambique    Africa  1997   46.344  16603334    472.346077
361         Cote d'Ivoire    Africa  1957   42.469   3300000   1500.895925
1558  Trinidad and Tobago  Americas  2002   68.976   1101832  11460.600230
1050              Myanmar      Asia  1982   58.056  34680442    424.000000
1579               Turkey    Europe  1987   63.108  52881328   5089.043686
854                Kuwait      Asia  1962   60.470    358266  95458.111760

In [19]:
df.sample(10,random_state=10)

                    country continent  year  lifeExp       pop     gdpPercap
1040             Mozambique    Africa  1992   44.284  13160731    410.896824
1308           Saudi Arabia      Asia  1952   39.875   4005677   6459.554823
1041             Mozambique    Africa  1997   46.344  16603334    472.346077
361           Cote d'Ivoire    Africa  1957   42.469   3300000   1500.895925
1558    Trinidad and Tobago  Americas  2002   68.976   1101832  11460.600230
1050                Myanmar      Asia  1982   58.056  34680442    424.000000
1579                 Turkey    Europe  1987   63.108  52881328   5089.043686
854                  Kuwait      Asia  1962   60.470    358266  95458.111760
1303  Sao Tome and Principe    Africa  1987   61.728    110812   1516.525457
1573                 Turkey    Europe  1957   48.079  25670939   2218.754257

In [20]:
df.sample(9,random_state=10)

                    country continent  year  lifeExp       pop     gdpPercap
1040             Mozambique    Africa  1992   44.284  13160731    410.896824
1308           Saudi Arabia      Asia  1952   39.875   4005677   6459.554823
1041             Mozambique    Africa  1997   46.344  16603334    472.346077
361           Cote d'Ivoire    Africa  1957   42.469   3300000   1500.895925
1558    Trinidad and Tobago  Americas  2002   68.976   1101832  11460.600230
1050                Myanmar      Asia  1982   58.056  34680442    424.000000
1579                 Turkey    Europe  1987   63.108  52881328   5089.043686
854                  Kuwait      Asia  1962   60.470    358266  95458.111760
1303  Sao Tome and Principe    Africa  1987   61.728    110812   1516.525457

In [21]:
df.sample(2,random_state=10)

           country continent  year  lifeExp       pop    gdpPercap
1040    Mozambique    Africa  1992   44.284  13160731   410.896824
1308  Saudi Arabia      Asia  1952   39.875   4005677  6459.554823

In [22]:
df.sample(3,random_state=10)

           country continent  year  lifeExp       pop    gdpPercap
1040    Mozambique    Africa  1992   44.284  13160731   410.896824
1308  Saudi Arabia      Asia  1952   39.875   4005677  6459.554823
1041    Mozambique    Africa  1997   46.344  16603334   472.346077

In [23]:
df.sample(4,random_state=10)

            country continent  year  lifeExp       pop    gdpPercap
1040     Mozambique    Africa  1992   44.284  13160731   410.896824
1308   Saudi Arabia      Asia  1952   39.875   4005677  6459.554823
1041     Mozambique    Africa  1997   46.344  16603334   472.346077
361   Cote d'Ivoire    Africa  1957   42.469   3300000  1500.895925

In [24]:
df.sample(7,random_state=10)

                  country continent  year  lifeExp       pop     gdpPercap
1040           Mozambique    Africa  1992   44.284  13160731    410.896824
1308         Saudi Arabia      Asia  1952   39.875   4005677   6459.554823
1041           Mozambique    Africa  1997   46.344  16603334    472.346077
361         Cote d'Ivoire    Africa  1957   42.469   3300000   1500.895925
1558  Trinidad and Tobago  Americas  2002   68.976   1101832  11460.600230
1050              Myanmar      Asia  1982   58.056  34680442    424.000000
1579               Turkey    Europe  1987   63.108  52881328   5089.043686

In [25]:
df.lifeExp.sort_values(ascending=True)

1292    23.599
0       28.801
552     30.000
36      30.015
1344    30.331
         ...
1487    81.701
695     81.757
802     82.000
671     82.208
803     82.603
Name: lifeExp, Length: 1704, dtype: float64

In [26]:
df.year.sort_values(ascending=False)

1703    2007
491     2007
515     2007
527     2007
539     2007
        ...
1116    1952
1128    1952
1140    1952
1152    1952
852     1952
Name: year, Length: 1704, dtype: int64

In [27]:
df.loc[4,['lifeExp','pop']]

lifeExp      36.088
pop        13079460
Name: 4, dtype: object

In [28]:
df.loc[3,['continent']]

continent    Asia
Name: 3, dtype: object

In [31]:
df.loc[5,['pop']]

pop    14880372
Name: 5, dtype: object

In [32]:
df.loc[4,['pop']]

pop    13079460
Name: 4, dtype: object

In [33]:
df.year.sort_values(ascending=True)

0       1952
528     1952
540     1952
1656    1952
552     1952
        ...
1127    2007
1139    2007
1151    2007
1175    2007
1703    2007
Name: year, Length: 1704, dtype: int64

In [34]:
df.year

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: year, Length: 1704, dtype: int64

In [35]:
df.tail()

       country continent  year  lifeExp       pop   gdpPercap
1699  Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700  Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701  Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702  Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703  Zimbabwe    Africa  2007   43.487  12311143  469.709298

In [36]:
df['year'].unique()

array([1952, 1957, 1962, 1967, 1972, 1977, 1982, 1987, 1992, 1997, 2002,
       2007], dtype=int64)

In [37]:
df['lifeExp'].unique()

array([28.801, 30.332, 31.997, ..., 46.809, 39.989, 43.487])

In [38]:
df['gdpPercap'].unique()

array([779.4453145, 820.8530296, 853.10071  , ..., 792.4499603,
       672.0386227, 469.7092981])

In [39]:
df['pop'].unique()

array([ 8425333,  9240934, 10267083, ..., 11404948, 11926563, 12311143],
      dtype=int64)

In [40]:
df['country'].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)